[{"created_at":"2020-07-25T17:33:39Z","updated_at":"2020-07-25T17:46:35Z","body":"Going for a walk at 11 PM is just right, the weather has cooled down, there are few pedestrians and a few sporadic cars on the road, no noise in the environment, the earphones' sound effects can be fully utilized, and the mental state is just right at this time, unlike in the morning when I am still not fully awake or in the evening when I am dizzy from work. ☕️"},{"created_at":"2020-08-06T06:29:44Z","updated_at":"2020-08-07T05:50:04Z","body":"The sound quality experience of Bluetooth earphones in descending order:\n\n- Edifier Lollipods (¥225)\n- Redmi AirDots (¥99)\n- Xiaomi Air2 SE (¥138)\n- Fake AirPods (¥198)\n- Shanzhai AirPods (¥30)\n- Others (¥50-)"},{"created_at":"2020-08-08T11:48:33Z","updated_at":"2020-08-08T15:39:39Z","body":"Beijing's rental market within the Fifth Ring Road 🙃\n\n- 3000+: The living room is available\n- 2500, 2700: Master bedroom, double bed, large windows, large space\n- 2200: Standard secondary bedroom, suitable for one person, with some activity space\n- 1600, 1800: Small secondary bedroom, decoration depends on luck\n- 1500-: Dark room, attic, bed space"},{"created_at":"2020-08-08T12:58:24Z","updated_at":"2020-08-09T05:38:51Z","body":"When renting a house, I met a straightforward Northeastern lady. At that time, I looked at a house I wasn't satisfied with, and she kindly advised me to settle for it, saying there's no need to spend an extra thousand yuan for a window or balcony, this year earning money isn't easy, it's better to save the extra thousands in the bank. She said she'd been in this business for ten years, and looking for a house should be about fewer people, quietness, and cleanliness, just for sleeping. If you get married and have kids later, you can look for a better house then, but now you should save and accumulate money...\n\nI suddenly remembered a similar thing a real estate agent said last year when I was looking for a rental. The agent said renting a house is just for sleeping, during the day you work and at night you play with your phone, so there's no need for a big space, this place is good enough, and houses in this community would cost 80,000 or 90,000 to buy...\n\nI believed it last year, but not this time. It's not that they were lying; they might be telling the truth and sincerely advising me.\n\nIt seems my purpose was never to save money. Maybe they represent a type of person who works hard for a living, staying in a first-tier city just for a higher salary, to earn more money. I believe no one would say they love the real estate agent profession, love playing with information gaps, using tactics, enjoy introducing houses by twisting facts, and calling customers brother or sister for fun.\n\nIf work could have regular weekends off, there would be 8 days a month to freely manage, plus a few hours every evening after work. Actually, there is a lot of time for oneself. This is very important and enriching time, especially this year with the pandemic limiting places to go, deepening my fear of confined living, and a bad state of life taking up a lot of mood, and... original sin, is there a type :) "},{"created_at":"2020-08-11T03:25:43Z","updated_at":"2020-08-11T03:25:43Z","body":"Examples of redundancy in text found in CoolShell articles:\n\n> So I made extensive deletions, cuts, rewrites, and additions to the original text, **mainly** deleting some paragraphs without information and **mainly** adding other content related to how to implement timing attacks. \n>\n>—— 'Timing Attacks TIMING ATTACKS'\n\n> The **main** content of this article is **mainly** from a live broadcast I did at Tencent in March this year, **mainly** aimed at giving some technical personnel a general understanding of the world.\n>\n>—— 'How Programmers Control Their Careers'"},{"created_at":"2020-08-13T11:18:51Z","updated_at":"2020-08-13T11:18:51Z","body":"> Although significant time has passed since the writing of this book, surprisingly little needs to be changed. Why? Because the emphasis is on people, on how we, as human beings, interact with the physical objects in the\nworld. This interaction is governed by our biology, psychology, society,\nand culture. Human biology and psychology do not change much with\ntime: society and culture change very slowly.\n\n—— 'The Design of Everyday Things'"},{"created_at":"2020-08-17T10:09:09Z","updated_at":"2020-08-29T06:24:31Z","body":"Xi Jinping presides over the collective study and speaks at the 19th Central Political Bureau:\n\nNo. | Time | Theme\n-- | -- | --\nEighteen | 2019.10.25 | Take **blockchain** as an important breakthrough for core technology independent innovation and accelerate the development of blockchain technology and industrial innovation\n...\nNine | 2018.10.31 | Strengthen leadership, make good planning, clarify tasks, and lay a solid foundation to promote the healthy development of **artificial intelligence** in our country\n\nReference links:\n- [19th, 18th](http://www.12371.cn/special/lnzzjjtxx/)\n- [17th](http://www.gov.cn/test/2009-02/25/content_1241784.htm)"},{"created_at":"2020-08-19T05:09:16Z","updated_at":"2020-08-19T05:11:01Z","body":"You should like the work, not the person who created the work. \n\nFollowing someone is often because a person who creates excellent works is more likely to create the next excellent work. \n\nThe work and personal attributes are unrelated. A work is good because the work itself is good, not because of who made it. \n\nBelieve in the power of rationality, refuse and avoid personal worship."},{"created_at":"2020-08-24T10:49:38Z","updated_at":"2020-08-24T10:54:58Z","body":"I found that the best parts of a book are often the preface, introduction, and postscript 🙃"},{"created_at":"2020-09-07T03:59:53Z","updated_at":"2020-09-07T04:48:47Z","body":"Late last night, I watched a QCon video [The Why of Go](https://www.infoq.com/presentations/go-concurrency-gc/?itm_source=presentations_about_golang&itm_medium=link&itm_campaign=golang). Seeing such a grand title, I thought it would contain some impressive content, but it only mentioned three advantages of Golang: goroutines, typed garbage collection, and a concise standard library. Apart from goroutines, the other two points are not very noticeable to programmers. However, the video mentioned [go-is-not-good](https://github.com/ksimka/go-is-not-good), which is quite interesting, detailing various shortcomings of Golang.\n\nThe points mentioned in the video didn't seem very convincing, so I checked and found that the video presenter, Carmen Andoh, is a Google employee and can be considered a Golang evangelist. From Carmen's GitHub account [Lyoness](https://github.com/Lyoness?tab=overview&from=2016-12-01&to=2016-12-31), her coding skills do not seem significant, and during her presentation, she often has a hand-covering-mouth gesture, which makes me wonder if she lacks confidence in the content of her speech."},{"created_at":"2020-09-09T03:59:09Z","updated_at":"2020-09-09T03:59:09Z","body":"Most English emails have an Unsubscribe link at the bottom, but almost no Chinese emails do."},{"created_at":"2020-09-10T16:24:27Z","updated_at":"2020-09-11T01:00:21Z","body":"Saw two short videos on YouTube, [Video 1](https://youtu.be/eis11j_iGMs), [Video 2](https://youtu.be/9T8A89jgeTI), explaining lambda calculus and the Y combinator, concise and understandable."},{"created_at":"2020-09-15T01:24:01Z","updated_at":"2020-09-15T05:51:01Z","body":"\"The importance of xxx is self-evident\" is a boring and useless phrase, indicating ignorance and blind obedience. Unspeakable is difficult to explain."},{"created_at":"2020-09-16T05:42:33Z","updated_at":"2020-09-18T01:21:09Z","body":"There is an old cliché term called 'curd boy', referring to programmers whose job content is just adding, deleting, modifying, and querying databases, and calling interfaces, without technical content;\n\nRecently saw a term on Maimai called 'nginx engineer', referring to junior leaders who forward orders from senior leaders precisely to others, which seems like a technical job (sarcastic);\n\nJust thought of a term called 'demo boy', referring to programmers who work on pre-sales projects and project prototypes. The difference from 'Party B' is that requirements are unclear and uncertain, and Party A can change requirements at any time, and the code may need to be rewritten, so only prototypes or demos are made.\n\nSimilar terms include sql boy, rpc boy, etc."},{"created_at":"2020-09-21T02:27:49Z","updated_at":"2020-09-21T02:27:49Z","body":"Ruan Yifeng's understanding of closures in 2009 in the article 'Learning Javascript Closures' is wrong."},{"created_at":"2020-09-24T10:34:53Z","updated_at":"2020-09-24T10:38:53Z","body":"Just realized that Java's Functional Interface is actually quite powerful (since Java 8 in 2014), but callback writing is rarely seen in Java.\n\nWhy does JavaScript use callbacks a lot? Because many scenarios in js are asynchronous network requests, requiring asynchronous handling of data. \n\nWhy are callbacks common in Golang? Because Golang has explicit pass-by-reference, and writing a star in Golang is much simpler than creating an object in Java.\n\nSo although Java's Functional Interface is usable, it just makes up for Java's shortcomings, but it doesn't mean Java is strong enough (of course, Java is indeed very powerful)."},{"created_at":"2020-10-05T04:58:12Z","updated_at":"2020-10-10T02:26:03Z","body":"I have three email apps installed on my phone: QQ Mail, Ali Mail, and Gmail. In the IOS 14 APP resource library, the categorization of these apps is intuitively displayed:\n\nQQ Mail is categorized under 'Tools', which includes system apps like App Store, Safari, Find My, Clock, Compass, and System Settings... What makes QQ Mail so special?\n\nAli Mail is categorized under 'Social', which includes apps like WeChat, Phone, and Messages. What is Ali Mail thinking?\n\nGmail is categorized under 'Productivity'."},{"created_at":"2020-10-10T02:24:10Z","updated_at":"2020-10-10T02:24:10Z","body":"High accuracy is a sign of strength, while low accuracy is a sign of effort.\n\nIf the accuracy is very high and the number of passes is also high, it means the ability is above the standard line, but it also means the experience gained during the process is limited.\n\nIf the accuracy is very low but the number of passes is high, it means a process of continuous trial and error, and the problems were eventually solved. The experience gained is unprecedented for the person involved.\n\nTherefore, low accuracy should not be a source of shame."},{"created_at":"2020-10-11T11:50:20Z","updated_at":"2020-10-12T10:39:04Z","body":"If you were confined in a dark and damp prison for a long time. One day, a ray of sunlight came in.\n\n- If you ask the sunlight, would you be willing to stay here?\n    - If the sunlight says yes, the room will no longer be damp and dark.\n    - If the sunlight says no, the ray of sunlight will disappear, and the room will continue to be damp and dark.\n\n- If you don't ask the sunlight, the ray of sunlight will stay briefly, but how long it stays is unknown. And the sunlight will not know you need it."},{"created_at":"2020-10-20T01:44:18Z","updated_at":"2020-10-20T04:13:14Z","body":"Recently encountered a small issue: a document needed to be completed by multiple people, each writing their part, and then unified by one person. After merging, if there are changes, strictly follow the merged format and send it back to the person who unified it.\n\nIt reminded me of a story seen in a microblog or book: Decades ago, a foreigner came to China to supervise and watched people working on a construction site. The supervisor found that people often worked together to move a bag of cement from one place to another, but no one would find a cart to help. In places where carts were used, the axles of the wheels were long overdue for maintenance, making squeaky noises, but no one would apply some lubricant to eliminate the noise.\n\nSo, the issues with document collaboration are:\n1. Collaborative editing tools are already common, why is no one using them?\n2. Does Office have mechanisms to enforce style formats, ensuring consistency across versions and platforms, making it impossible to change styles? If it does, why is no one using it? If not, why not?\n3. Process issues, strictly correcting styles should be done after ensuring the content will not change. Not adjusting the style first and then letting others change accordingly.\n\nThese are all suggestions and questions, there are no answers yet (there will be in the future).\n\nKnown about Office styles:\n1. Office has a template function, but it's just a template, not an enforced constraint. Even as a template, it seems no one uses it.\n2. Office provides an API to generate documents according to specified formats, but the cost is a bit high for small-scale use.\n\nAlso puzzled by the font issues in Office. After editing on different platforms and software, the font configuration changes.\n\nHTML's logic for fonts is that stylesheets (CSS) determine the fonts. If the font exists, it is displayed as specified; if not, it defaults to the system font. Fonts are a configuration, dependent only on configuration files, and unrelated to platform environment. This configuration does not change automatically unless consciously modified.\n\nOffice's font issue is a boring problem."},{"created_at":"2020-10-21T01:36:19Z","updated_at":"2020-10-21T01:36:19Z","body":"If you have a cat, get a Garfield; if you have a dog, get an Akita."},{"created_at":"2020-11-03T08:26:55Z","updated_at":"2020-11-30T10:43:32Z","body":"There is no usable PDF annotation tool across the Linux platform, nor any web-based online tool.\n\n(2020.11.30: WPS PDF)"},{"created_at":"2020-11-05T01:24:25Z","updated_at":"2020-11-05T01:24:58Z","body":"Some blogs have been written for ten years, but still contain immature content, lacking depth, thought, and insight, with plain and brief content. \nSome 'technical' blogs are technically advanced but present the details rigidly, like technical documentation. \nOther 'technical' blogs are low-level and specific, writing about trivial content. \nSome 'artsy' blogs generally have little content, with few original pieces. \nThere are also 'show-off' blogs, mainly recording travel experiences. \n\nMost people lead an ordinary life."},{"created_at":"2020-11-12T09:25:00Z","updated_at":"2020-11-12T09:25:00Z","body":"Three types of confusion:\n\nOne is not knowing what to do, with a blank mind;\nTwo is having many things to do, with a long list of to-do items, but not sure which one to choose;\nThree is knowing what to do but being physiologically uncooperative."},{"created_at":"2020-11-13T18:28:15Z","updated_at":"2020-11-13T18:28:15Z","body":"🥱"},{"created_at":"2020-11-15T00:22:43Z","updated_at":"2020-11-15T13:58:21Z","body":"Some people use the phrase 'at an age when nothing is achieved, encountered something'. The first half of the sentence is wrong; many people will achieve nothing their entire lives, regardless of age."},{"created_at":"2020-11-15T06:29:13Z","updated_at":"2020-11-15T06:29:13Z","body":"Just remembered a sentence but haven't figured out the logic in it: 'If I don't know you, I can't get close to you, but if I know you, I don't want to get close to you.'"},{"created_at":"2020-11-21T06:30:13Z","updated_at":"2020-11-22T05:02:13Z","body":"Always used Ele.me, but recently found that many frequently ordered stores suddenly require a minimum purchase of two items. Clicking the + sign adds 2 items, and clicking the - sign removes all. It's not the kind of two-item minimum clearly marked by the merchant, it's unclear.\n\nIf the actual payment amount does not meet the delivery minimum, it should prompt, not just remove the option for selecting 1 item.\n\nAlso, Ele.me requires spending a few more cents to select the 'On-time Delivery Plus' service to get a compensation red envelope for delayed deliveries, and this option cannot be selected by default. Many stores on Meituan Waimai offer default compensation services without additional cost.\n\nI should use Meituan Waimai in the future."},{"created_at":"2020-12-07T16:33:10Z","updated_at":"2020-12-07T16:35:35Z","body":"Why do people's emotions towards things fade, that is, the threshold keeps increasing? How can this be explained from the perspective of biological evolution?\n\nInitially, eating a certain food feels delicious, but after eating it several times, it's not as tasty anymore. This is a common phenomenon.\n\nIf you rarely watch funny videos, they seem very funny. Watching a lot, you only feel the same level of joy by increasing the quality and quantity.\n\nThis is unreasonable, things that bring positive emotions should have consistent reactions.\n\nLater, I discovered that the body's reaction to negative emotions also gradually decreases, such as sadness and pain.\n\nFor someone who hasn't eaten spicy food for a long time, a little bit can feel very spicy. After eating a lot, only extremely spicy tastes will do.\n\nIn other words, the body reduces its response to anything that causes emotional fluctuations. The body cannot distinguish between positive and negative emotions. For a bunch of cells, it's all chemical and biological reactions.\n\nThe question remains, why did evolution go this way?"},{"created_at":"2020-12-10T01:36:39Z","updated_at":"2020-12-10T01:36:39Z","body":"It seems that only Chinese people like to use phrases like 'the father of xxx' which have connotations of personal worship.\n\nCompare the term 'No Silver Bullet' on Wikipedia in Chinese, English, and Japanese versions:\n\n- [没有银弹](https://zh.wikipedia.org/wiki/%E6%B2%A1%E6%9C%89%E9%93%B6%E5%BC%B9)\n- [No Silver Bullet](https://en.wikipedia.org/wiki/No_Silver_Bullet)\n- [銀の弾などない](https://ja.wikipedia.org/wiki/%E9%8A%80%E3%81%AE%E5%BC%BE%E3%81%AA%E3%81%A9%E3%81%AA%E3%81%84)"},{"created_at":"2020-12-11T01:08:58Z","updated_at":"2020-12-11T05:46:27Z","body":"Just noticed that the original title of 'Friends' is *Friends*. I initially searched with 'old friends' but couldn't find it. Is there a better translation for the title? Seems not. Better not translate it."},{"created_at":"2020-12-20T17:37:22Z","updated_at":"2020-12-20T17:37:22Z","body":"Pure memorization is meaningless. Memorizing book and online content only 'seems' impressive, deceiving ignorant people. If you understand computers and the internet as another form of life, it will be more knowledgeable than any human."},{"created_at":"2020-12-20T18:26:22Z","updated_at":"2020-12-20T18:26:22Z","body":"So why, when discussing Turing's halo, is there no mention of Turing's imitation game and learning machine?"}]